# Задача 1.

# Вычислить число ПИ c заданной точностью *d*
# Пример:
# при d = 0.001, π = 3.141
# при d = 0.1, π = 3.1
# при d = 0.00001, π = 3.14154
# d от 0.1 до 0.0000000001



import math


from_user = str(input("Введите точность числа '兀' (например 0,001): "))
len_show = len(str(from_user).split('.,')[-1])
print(f'兀 = {str(math.pi)[:len_show]}')



